[
  {
    "ministry_id":"dee46e0227db",
    "ministry_name":"Commission on Administrative Justice",
    "ministry_description":"The Commission on Administrative Justice, also known as the Office of the Ombudsman or the Kenyan Ombudsman, is an independent government institution in Kenya. It was established under the Constitution of Kenya, specifically under Chapter 15, to promote administrative justice, fairness, transparency, and accountability within the public sector.",
    "reported_agency_count":1,
    "observed_agency_count":1,
    "reported_service_count":1,
    "observed_service_count":1,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/commission-on-administrative-justice"
  },
  {
    "ministry_id":"7a55ca42d67f",
    "ministry_name":"Executive Office Of The President",
    "ministry_description":"The Executive Office of the President is a central administrative body in the government of Kenya. It serves as the primary support structure for the President, providing strategic advice, policy development, and implementation coordination. The office plays a pivotal role in coordinating the activities of various ministries and government agencies, ensuring efficient governance and effective decision-making. It facilitates the President’s leadership in guiding national priorities, promoting economic growth, and addressing social and political challenges.",
    "reported_agency_count":1,
    "observed_agency_count":1,
    "reported_service_count":3,
    "observed_service_count":3,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/executive-office-of-the-president"
  },
  {
    "ministry_id":"84b249e08c14",
    "ministry_name":"Ministry Of Agriculture And Livestock Development",
    "ministry_description":"The Ministry of Agriculture and Livestock Development is responsible for formulating and implementing policies, regulations, and strategies for the development of agriculture and livestock in Kenya. The ministry aims to promote sustainable agricultural practices and enhance food security, income generation, and job creation in rural areas. Its core functions include crop development, livestock development, land development, agricultural research, agricultural extension services, and marketing and trade. The ministry also collaborates with various stakeholders such as farmers, private sector players, and development partners to achieve its objectives.",
    "reported_agency_count":31,
    "observed_agency_count":31,
    "reported_service_count":864,
    "observed_service_count":577,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-agriculture-and-livestock-development"
  },
  {
    "ministry_id":"5ecbeaab9e41",
    "ministry_name":"Ministry Of Cooperatives And Micro, Small And Medium Enterprises (MSME) Development",
    "ministry_description":"The Ministry of Cooperatives and Micro, Small and Medium Enterprises (MSME) Development is responsible for creating an enabling environment for the growth and development of cooperatives and MSMEs in Kenya. The ministry aims to promote the establishment and growth of sustainable cooperatives and MSMEs that contribute to job creation, poverty reduction, and economic growth. Its functions include providing policy guidance, regulatory oversight, and capacity building support to cooperatives and MSMEs. The ministry also works closely with other government agencies, private sector players, and development partners to promote the development of cooperatives and MSMEs.",
    "reported_agency_count":7,
    "observed_agency_count":7,
    "reported_service_count":62,
    "observed_service_count":62,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-cooperatives-and-micro-small-and-medium-enterprises-msme-development"
  },
  {
    "ministry_id":"bfc0ad498f1a",
    "ministry_name":"Ministry of Defence",
    "ministry_description":"The Kenyan Ministry of Defense is a governmental body responsible for overseeing the country’s defense and security affairs. It plays a crucial role in safeguarding national sovereignty, protecting citizens, and maintaining peace. The ministry coordinates the activities of the Kenyan Defense Forces, which include the Army, Air Force, and Navy. It ensures the readiness and modernization of the armed forces to address both external and internal security challenges.",
    "reported_agency_count":4,
    "observed_agency_count":4,
    "reported_service_count":21,
    "observed_service_count":20,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-defence-ministry-of-defence-ministry-of-defence"
  },
  {
    "ministry_id":"7e71e6830cb0",
    "ministry_name":"Ministry Of East African Community (EAC), The ASALs and Regional Development",
    "ministry_description":"The Ministry of East African Community (EAC), The ASALs (Arid and Semi-Arid Lands), and Regional Development in Kenya is responsible for promoting regional integration and cooperation among East African countries. With a focus on the ASALs, the ministry aims to enhance sustainable development in these regions through various initiatives, including infrastructure development, natural resource management, and livelihood improvement programs. It plays a crucial role in fostering economic growth, social inclusion, and environmental sustainability in Kenya and the wider East African region.",
    "reported_agency_count":0,
    "observed_agency_count":4,
    "reported_service_count":11,
    "observed_service_count":11,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-east-african-community-eac-the-asals-regional-development"
  },
  {
    "ministry_id":"21513791e78a",
    "ministry_name":"Ministry Of Education",
    "ministry_description":"The Ministry of Education is responsible for the development, implementation, and management of policies, regulations, and programs related to education in Kenya. The ministry aims to provide quality, relevant, and accessible education to all Kenyan citizens, from early childhood to tertiary levels. Its functions include curriculum development, teacher training and management, education planning and management, research and development, and quality assurance. The ministry also oversees the management of public universities, tertiary institutions, and other educational institutions. It works closely with stakeholders such as parents, teachers, students, and development partners to achieve its objectives.",
    "reported_agency_count":60,
    "observed_agency_count":60,
    "reported_service_count":705,
    "observed_service_count":689,
    "observed_department_count":3,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-education"
  },
  {
    "ministry_id":"8d57dacf896b",
    "ministry_name":"Ministry Of Energy And Petroleum",
    "ministry_description":"The Ministry of Energy and Petroleum is responsible for the development and implementation of policies, regulations, and programs related to the energy and petroleum sectors in Kenya. The ministry aims to ensure the provision of affordable, reliable, and sustainable energy to all Kenyan citizens, while promoting the exploration, production, and utilization of petroleum resources. Its functions include energy policy formulation, electricity generation, transmission, and distribution, renewable energy development, oil and gas exploration and development, and regulation of the energy and petroleum sectors. The ministry also works closely with stakeholders such as energy consumers, private sector players, and development partners to achieve its objectives.",
    "reported_agency_count":4,
    "observed_agency_count":4,
    "reported_service_count":63,
    "observed_service_count":52,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-energy-and-petroleum"
  },
  {
    "ministry_id":"8bfda0c9fd5d",
    "ministry_name":"Ministry Of Environment, Climate Change And Forestry",
    "ministry_description":"The Ministry of Environment, Climate Change and Forestry is responsible for the formulation and implementation of policies, regulations, and programs related to the environment, climate change, and forestry in Kenya. The ministry aims to promote sustainable management of natural resources and ecosystems, reduce greenhouse gas emissions, and enhance resilience to climate change impacts. Its functions include environmental policy formulation and implementation, climate change mitigation and adaptation, forest conservation and management, biodiversity conservation, and environmental impact assessment. The ministry also works closely with various stakeholders, including the private sector, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":6,
    "observed_agency_count":6,
    "reported_service_count":486,
    "observed_service_count":480,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-environment-climate-change-and-forestry"
  },
  {
    "ministry_id":"0807579f15e9",
    "ministry_name":"Ministry Of Foreign And Diaspora Affairs",
    "ministry_description":"The Ministry of Foreign and Diaspora Affairs in Kenya is responsible for managing the country’s international relations and addressing the concerns of Kenyan citizens living abroad. It focuses on promoting diplomatic ties, safeguarding national interests, and enhancing cooperation with foreign nations. Additionally, the ministry plays a pivotal role in providing assistance and support to the Kenyan diaspora community, ensuring their welfare and addressing their needs.",
    "reported_agency_count":2,
    "observed_agency_count":2,
    "reported_service_count":23,
    "observed_service_count":23,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-foreign-and-diaspora-affairs"
  },
  {
    "ministry_id":"94e331142388",
    "ministry_name":"Ministry Of Gender, Culture, The Arts and Heritage",
    "ministry_description":"The Ministry of Gender, Culture, The Arts & Heritage is a governmental body dedicated to promoting and integrating principles of gender equality, cultural development, artistic expression, and heritage preservation. The ministry’s mission encompasses a broad spectrum of activities and initiatives aimed at fostering a society that values diversity, supports artistic endeavors, and protects its cultural and historical assets. Below is a detailed description of the ministry’s key areas of focus",
    "reported_agency_count":9,
    "observed_agency_count":9,
    "reported_service_count":35,
    "observed_service_count":26,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-gender-culture-the-arts-heritage"
  },
  {
    "ministry_id":"6c0348f40cf6",
    "ministry_name":"Ministry Of Health",
    "ministry_description":null,
    "reported_agency_count":24,
    "observed_agency_count":24,
    "reported_service_count":378,
    "observed_service_count":376,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-health"
  },
  {
    "ministry_id":"6c3eb781924c",
    "ministry_name":"Ministry Of Information, Communications And The Digital Economy",
    "ministry_description":"The Ministry of Information, Communications, and the Digital Economy is responsible for the development and implementation of policies, regulations, and programs related to information, communication, and digital technologies in Kenya. The ministry aims to promote the growth of the digital economy, increase access to affordable and quality communication services, and enhance the use of ICTs for social and economic development. Its functions include policy formulation, regulation and oversight of the ICT sector, management of the national ICT infrastructure, and promotion of e-government services. The ministry also works closely with various stakeholders, including private sector players, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":10,
    "observed_agency_count":10,
    "reported_service_count":112,
    "observed_service_count":111,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-information-communications-and-the-digital-economy"
  },
  {
    "ministry_id":"3496434dc65d",
    "ministry_name":"Ministry Of Interior And National Administration",
    "ministry_description":"The Ministry of Interior and National Administration is responsible for maintaining peace, security, and public order in Kenya. The ministry aims to ensure the safety of Kenyan citizens, protect Kenya’s borders, and manage the country’s administrative structures. Its functions include national security policy formulation and implementation, management of the police force, administration of national and county government affairs, immigration and border control, and management of civil registration and documentation. The ministry also works closely with various stakeholders, including security agencies, county governments, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":15,
    "observed_agency_count":15,
    "reported_service_count":145,
    "observed_service_count":141,
    "observed_department_count":3,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-interior-and-national-administration"
  },
  {
    "ministry_id":"0aac37ecd8a7",
    "ministry_name":"Ministry Of Investments, Trade And Industry",
    "ministry_description":"The Ministry of Investments, Trade, and Industry in Kenya is a government institution responsible for promoting and regulating economic development in the country. It facilitates investment opportunities, encourages international trade, and supports industrial growth. Through strategic policies and initiatives, the ministry aims to attract foreign investments, enhance domestic businesses, foster innovation, and create employment opportunities, contributing to Kenya’s overall economic prosperity.",
    "reported_agency_count":11,
    "observed_agency_count":11,
    "reported_service_count":109,
    "observed_service_count":107,
    "observed_department_count":3,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-investments-trade-and-industry"
  },
  {
    "ministry_id":"6e9afa525641",
    "ministry_name":"Ministry Of Labour And Social Protection",
    "ministry_description":"The Ministry of Labour and Social Protection is responsible for the development and implementation of policies, regulations, and programs related to labour, social protection, and gender in Kenya. The ministry aims to promote decent work, social justice, and protection of the vulnerable in society. Its functions include labour policy formulation and regulation, promotion of employment and job creation, management of social protection programs, protection of the rights of workers and vulnerable groups, and gender mainstreaming. The ministry also works closely with various stakeholders, including employers, workers’ organizations, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":6,
    "observed_agency_count":6,
    "reported_service_count":53,
    "observed_service_count":32,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-labour-and-social-protection"
  },
  {
    "ministry_id":"6ae2ec611139",
    "ministry_name":"Ministry Of Lands, Public Works, Housing And Urban Development",
    "ministry_description":"The Ministry of Lands, Public Works, Housing, and Urban Development is responsible for the development and management of Kenya’s land, housing, and infrastructure sectors. The ministry aims to promote sustainable and equitable land use, affordable housing, and the development of infrastructure for social and economic development. Its functions include land administration, management, and surveying, urban and rural planning, management and maintenance of public works and infrastructure, housing policy formulation and promotion, and regulation and oversight of the housing and construction sector. The ministry also works closely with various stakeholders, including the private sector, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":3,
    "observed_agency_count":3,
    "reported_service_count":17,
    "observed_service_count":16,
    "observed_department_count":3,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-lands-public-works-housing-and-urban-development"
  },
  {
    "ministry_id":"47da91e864d6",
    "ministry_name":"Ministry Of Mining, Blue Economy And Maritime Affairs",
    "ministry_description":"The Ministry of Mining, Blue Economy, and Maritime Affairs is responsible for the development and implementation of policies, regulations, and programs related to mining, the blue economy, and maritime affairs in Kenya. The ministry aims to promote sustainable development of the mining sector, harness the potential of the blue economy, and enhance Kenya’s maritime security and cooperation. Its functions include mining policy formulation and regulation, promotion of value addition in the mining sector, development of the blue economy, maritime affairs management and regulation, and promotion of marine research and technology. The ministry also works closely with various stakeholders, including the private sector, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":5,
    "observed_agency_count":5,
    "reported_service_count":125,
    "observed_service_count":102,
    "observed_department_count":3,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-mining-blue-economy-and-maritime-affairs"
  },
  {
    "ministry_id":"01d256f861be",
    "ministry_name":"Ministry Of Public Service, Gender And Affirmative Action",
    "ministry_description":null,
    "reported_agency_count":6,
    "observed_agency_count":6,
    "reported_service_count":232,
    "observed_service_count":231,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-public-service-gender-and-affirmative-action"
  },
  {
    "ministry_id":"de273f239829",
    "ministry_name":"Ministry Of Roads And Transport",
    "ministry_description":"The Ministry of Roads and Transport is responsible for the development and maintenance of Kenya’s transport infrastructure, including roads, railways, and airports. The ministry aims to provide efficient and safe transport services to all Kenyan citizens and promote the development of the transport sector. Its functions include policy formulation, planning, and implementation of transport infrastructure projects, regulation and oversight of the transport sector, and development of transport-related legislation. The ministry also works closely with various stakeholders, including the private sector, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":13,
    "observed_agency_count":13,
    "reported_service_count":2034,
    "observed_service_count":1196,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-roads-and-transport"
  },
  {
    "ministry_id":"67e018216ddb",
    "ministry_name":"Ministry Of Tourism, Wildlife And Heritage",
    "ministry_description":"The Ministry of Tourism, Wildlife, and Heritage is responsible for the development and implementation of policies, regulations, and programs related to tourism, wildlife, and heritage conservation in Kenya. The ministry aims to promote sustainable tourism development, conservation of wildlife and natural resources, and preservation of Kenya’s cultural heritage. Its functions include tourism policy formulation and promotion, wildlife conservation and management, heritage conservation, and regulation of the tourism sector. The ministry also works closely with various stakeholders, including tourism operators, conservation organizations, cultural institutions, and development partners, to achieve its objectives.",
    "reported_agency_count":9,
    "observed_agency_count":9,
    "reported_service_count":237,
    "observed_service_count":230,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-tourism-wildlife-and-heritage"
  },
  {
    "ministry_id":"99fc3256de0e",
    "ministry_name":"Ministry Of Water, Sanitation And Irrigation",
    "ministry_description":"The Ministry of Water, Sanitation, and Irrigation in Kenya is responsible for the management and development of water resources, sanitation systems, and irrigation infrastructure across the country. Its primary goal is to ensure access to clean and safe water for all Kenyans, promote proper sanitation practices, and enhance agricultural productivity through effective irrigation methods. The ministry formulates policies, regulates water usage, oversees water resource management, promotes water conservation, and implements projects to improve water supply, sanitation facilities, and irrigation schemes throughout Kenya.",
    "reported_agency_count":12,
    "observed_agency_count":12,
    "reported_service_count":77,
    "observed_service_count":71,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-water-sanitation-and-irrigation"
  },
  {
    "ministry_id":"c8ac65a37ffd",
    "ministry_name":"Ministry of Youth Affairs, Creative Economy and Sports",
    "ministry_description":"The Ministry of Youth Affairs, Sports, and the Arts is responsible for the development and implementation of policies, regulations, and programs related to youth, sports, and the arts in Kenya. The ministry aims to promote the participation of youth in nation-building, enhance sports development, and support the growth of the arts sector. Its functions include youth policy formulation and implementation, promotion of sports development and excellence, and support for the growth and development of the arts sector. The ministry also works closely with various stakeholders, including youth organizations, sports bodies, artists, and development partners, to achieve its objectives.",
    "reported_agency_count":8,
    "observed_agency_count":8,
    "reported_service_count":69,
    "observed_service_count":74,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/ministry-of-youth-affairs-sports-and-the-arts"
  },
  {
    "ministry_id":"720783b02f35",
    "ministry_name":"Parliament of Kenya",
    "ministry_description":"Chapter eight of the Constitution establishes the Legislature. Article 93 of the Constitution establishes Parliament which consists of the National Assembly and the Senate. Article 93 (2) of the Constitution provides that the Houses of Parliament shall perform their respective roles and functions in accordance with the Constitution. Article 94, 95 and 96 provide for the role of Parliament, and functions of the two Houses respectively. The role of the Senate therefore includes exercise of the legislative authority of the Republic, manifest of the diversity of the nation, representation of will of the people, and exercise of their sovereignty, consideration and passing of amendments to this Constitution, alteration of county boundaries and protection of the Constitution and promotion of the democratic governance of the Republic.",
    "reported_agency_count":2,
    "observed_agency_count":2,
    "reported_service_count":40,
    "observed_service_count":40,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/parliament-of-kenya"
  },
  {
    "ministry_id":"333d0af8d562",
    "ministry_name":"The Judiciary",
    "ministry_description":"The Judiciary in Kenya is an independent branch of government responsible for administering justice and upholding the rule of law. Comprised of various courts and tribunals, it ensures fair and impartial resolution of disputes and protects individual rights. The Judiciary interprets and applies the Constitution, laws, and legal principles, fostering a just and equitable society. Through its commitment to independence, integrity, and professionalism, the Judiciary plays a crucial role in maintaining the legal framework and promoting access to justice for all Kenyan citizens.",
    "reported_agency_count":1,
    "observed_agency_count":1,
    "reported_service_count":87,
    "observed_service_count":87,
    "observed_department_count":1,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/the-judiciary"
  },
  {
    "ministry_id":"16190641f2b5",
    "ministry_name":"The National Treasury And Economic Planning",
    "ministry_description":"The National Treasury and Economic Planning is responsible for the management of Kenya’s public finances and the development and implementation of economic policies and plans. The ministry aims to ensure macroeconomic stability, sustainable fiscal management, and the promotion of inclusive economic growth. Its functions include fiscal and monetary policy formulation, public financial management, management of public debt, mobilization of domestic and external resources, and coordination of economic planning. The ministry also oversees the development and implementation of national budgets and works closely with various stakeholders, including other government agencies, the private sector, and development partners, to achieve its objectives.",
    "reported_agency_count":22,
    "observed_agency_count":22,
    "reported_service_count":798,
    "observed_service_count":657,
    "observed_department_count":4,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/the-national-treasury-and-economic-planning"
  },
  {
    "ministry_id":"b3491d8f52f4",
    "ministry_name":"The State Law Office",
    "ministry_description":"The Ministry of Justice, Legal Affairs, and Constitutional Affairs is responsible for the administration of justice and the development and implementation of legal policies and programs in Kenya. The ministry aims to promote access to justice, protection of human rights, and adherence to the rule of law. Its functions include legal policy formulation, development and review of legislation, management of the justice system, provision of legal advice to the government, and promotion of alternative dispute resolution mechanisms. The ministry also works closely with various stakeholders, including the judiciary, legal profession, civil society, and development partners, to achieve its objectives.",
    "reported_agency_count":10,
    "observed_agency_count":10,
    "reported_service_count":77,
    "observed_service_count":74,
    "observed_department_count":2,
    "ministry_url":"https:\/\/ecitizen.go.ke\/en\/ministries\/the-state-law-office"
  }
]
